num_layers: 122
quant_type: SYMMETRIC
calib_type: PERTENSOR
layers {
  layer_name: "TIDL_cast_in"
  layer_type: "TIDL_DataLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 0
    size: 1
    element_type: 0
    scale: 1
    zero_point: 0
  }
}
layers {
  layer_name: "TIDL_cast_in_netFormat"
  layer_type: "TIDL_DataConvertLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 253.000015
    size: 1
    element_type: 0
    scale: 1
    zero_point: 0
  }
}
layers {
  layer_name: "/backbone/stem/conv_in/conv/Conv_output_0"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: -62.635582
    max: 84.0456
    size: 1
    element_type: 1
    scale: 1.73846435546875
    zero_point: 4294967277
  }
  weights {
    min: -0.167355582
    max: 0.129137471
    size: 1
    element_type: 0
    scale: 764.83856201171875
    zero_point: 0
  }
  bias {
    min: -3.74361229
    max: 3.94473386
    size: 12
    element_type: 0
    scale: 32.448322296142578
    zero_point: 0
    value: -2.4230661392211914
    value: 3.3277392387390137
    value: 3.1404228210449219
    value: -3.7436122894287109
    value: -2.489382266998291
    value: -3.5283060073852539
    value: 2.9729552268981934
    value: 1.8054425716400146
    value: -2.1929440498352051
    value: 0.20068155229091644
    value: 1.56700599193573
    value: 3.9447338581085205
  }
}
layers {
  layer_name: "/backbone/stem/conv/activate/Relu_output_0"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 72.2013474
    size: 1
    element_type: 1
    scale: 3.531790018081665
    zero_point: 4294967168
  }
  weights {
    min: -0.577876568
    max: 0.429634511
    size: 1
    element_type: 0
    scale: 221.50059509277344
    zero_point: 0
  }
  bias {
    min: -1.05125523
    max: 4.61295605
    size: 16
    element_type: 0
    scale: 27.747934341430664
    zero_point: 0
    value: 0.89847010374069214
    value: -0.56040573120117188
    value: 3.0001828670501709
    value: 0.99458038806915283
    value: 2.6910359859466553
    value: 3.3643572330474854
    value: -1.0512552261352539
    value: 1.4107606410980225
    value: 4.6129560470581055
    value: -0.31913262605667114
    value: 0.039726484566926956
    value: 0.66148281097412109
    value: 4.3146562576293945
    value: 0.29712119698524475
    value: -0.3605620265007019
    value: 0.86916536092758179
  }
}
layers {
  layer_name: "/backbone/stage1/stage1.0/activate/Relu_output_0"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 68.3021469
    size: 1
    element_type: 1
    scale: 3.7334113121032715
    zero_point: 4294967168
  }
  weights {
    min: -0.653189182
    max: 0.713218868
    size: 1
    element_type: 0
    scale: 179.46804809570312
    zero_point: 0
  }
  bias {
    min: -1.59250557
    max: 5.90278816
    size: 32
    element_type: 0
    scale: 21.684667587280273
    zero_point: 0
    value: -0.038043539971113205
    value: -0.43941017985343933
    value: 0.9712754487991333
    value: -0.319969117641449
    value: 0.08322182297706604
    value: 0.41764757037162781
    value: -0.37024039030075073
    value: 0.21901413798332214
    value: 0.22901327908039093
    value: 0.62475526332855225
    value: 0.92764854431152344
    value: 5.1173639297485352
    value: -0.33694624900817871
    value: 1.3435205221176147
    value: -1.0828015804290771
    value: 0.58678847551345825
    value: 5.9027881622314453
    value: 0.43619418144226074
    value: 0.81300556659698486
    value: 0.47386899590492249
    value: -0.38779255747795105
    value: -0.25674587488174438
    value: 1.7064751386642456
    value: -0.46296906471252441
    value: 0.66569089889526367
    value: 2.9558172225952148
    value: 0.086234509944915771
    value: 0.50757986307144165
    value: -0.12510049343109131
    value: 0.9903302788734436
    value: -1.5925055742263794
    value: 0.59218442440032959
  }
}
layers {
  layer_name: "/backbone/stage1/stage1.1/short_conv/activate/Relu_output_0"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 37.2200851
    size: 1
    element_type: 0
    scale: 6.8511395454406738
    zero_point: 0
  }
  weights {
    min: -2.44666719
    max: 1.73680782
    size: 1
    element_type: 0
    scale: 52.316066741943359
    zero_point: 0
  }
  bias {
    min: -5.80814314
    max: 2.3028
    size: 16
    element_type: 0
    scale: 22.03802490234375
    zero_point: 0
    value: -0.74257010221481323
    value: -5.240379810333252
    value: 2.1054840087890625
    value: -2.9901673793792725
    value: -1.7225732803344727
    value: 0.50980293750762939
    value: 1.9846603870391846
    value: 2.3027999401092529
    value: -5.808143138885498
    value: -0.35768285393714905
    value: -0.81768649816513062
    value: -0.099220223724842072
    value: 1.6333688497543335
    value: 1.6697952747344971
    value: 1.8235220909118652
    value: 0.76468324661254883
  }
}
layers {
  layer_name: "/backbone/stage1/stage1.1/main_conv/activate/Relu_output_0"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 16.893898
    size: 1
    element_type: 0
    scale: 15.094207763671875
    zero_point: 0
  }
  weights {
    min: -1.27963006
    max: 0.730984747
    size: 1
    element_type: 0
    scale: 100.02890777587891
    zero_point: 0
  }
  bias {
    min: -3.25094223
    max: 4.65807962
    size: 16
    element_type: 0
    scale: 27.479135513305664
    zero_point: 0
    value: -0.25771152973175049
    value: -3.2509422302246094
    value: 0.15997764468193054
    value: 3.6343550682067871
    value: 1.2120065689086914
    value: 1.6619654893875122
    value: 2.6593942642211914
    value: 3.3934054374694824
    value: 1.2081124782562256
    value: 2.3155961036682129
    value: -1.2013851404190063
    value: -1.2138403654098511
    value: 4.6580796241760254
    value: -1.6830394268035889
    value: 4.49017333984375
    value: 2.70261287689209
  }
}
layers {
  layer_name: "/backbone/stage1/stage1.1/blocks/blocks.0/conv1/activate/Relu_output_0"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 16.9442711
    size: 1
    element_type: 1
    scale: 15.049334526062012
    zero_point: 4294967168
  }
  weights {
    min: -2.67722654
    max: 1.4552418
    size: 1
    element_type: 0
    scale: 47.810672760009766
    zero_point: 0
  }
  bias {
    min: -3.78193784
    max: 4.91261911
    size: 16
    element_type: 0
    scale: 26.055347442626953
    zero_point: 0
    value: 4.222869873046875
    value: 1.7287366390228271
    value: 2.4185359477996826
    value: 4.2165746688842773
    value: -1.9232332706451416
    value: 4.9126191139221191
    value: 4.3913326263427734
    value: 3.3235495090484619
    value: -1.9937566518783569
    value: -0.81400299072265625
    value: 1.3469830751419067
    value: 0.40883034467697144
    value: 0.19071115553379059
    value: -3.781937837600708
    value: -1.4120662212371826
    value: 2.1973450183868408
  }
}
layers {
  layer_name: "/backbone/stage1/stage1.1/blocks/blocks.0/conv2/activate/Relu_output_0"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 14.0519791
    size: 1
    element_type: 0
    scale: 18.146909713745117
    zero_point: 0
  }
  weights {
    min: -1.03653562
    max: 0.726004958
    size: 1
    element_type: 0
    scale: 123.48828125
    zero_point: 0
  }
  bias {
    min: -0.462500304
    max: 8.71001816
    size: 16
    element_type: 0
    scale: 14.695721626281738
    zero_point: 0
    value: 1.3357177972793579
    value: -0.46250030398368835
    value: -0.38742104172706604
    value: 2.4953250885009766
    value: 3.8567395210266113
    value: 0.57462859153747559
    value: 1.0325065851211548
    value: 0.65135681629180908
    value: 8.7100181579589844
    value: -0.059558339416980743
    value: 2.5157566070556641
    value: 1.6303114891052246
    value: 0.21578297019004822
    value: 1.1118378639221191
    value: -0.10007062554359436
    value: 1.4113961458206177
  }
}
layers {
  layer_name: "/backbone/stage1/stage1.1/blocks/blocks.0/Add_output_0"
  layer_type: "TIDL_EltWiseLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 18.700304
    size: 1
    element_type: 0
    scale: 7.5471038818359375
    zero_point: 0
  }
}
layers {
  layer_name: "/backbone/stage1/stage1.1/Concat_output_0"
  layer_type: "TIDL_ConcatLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 35.9139137
    size: 1
    element_type: 0
    scale: 6.8511395454406738
    zero_point: 0
  }
}
layers {
  layer_name: "/backbone/stage1/stage1.1/final_conv/activate/Relu_output_0"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 21.3536263
    size: 1
    element_type: 1
    scale: 11.941765785217285
    zero_point: 4294967168
  }
  weights {
    min: -1.3530798
    max: 0.86520046
    size: 1
    element_type: 0
    scale: 94.599006652832031
    zero_point: 0
  }
  bias {
    min: -3.23479939
    max: 8.27528572
    size: 32
    element_type: 0
    scale: 15.467743873596191
    zero_point: 0
    value: 3.5247752666473389
    value: 3.3276302814483643
    value: 1.4078457355499268
    value: 2.131300687789917
    value: -0.21379284560680389
    value: 2.7102317810058594
    value: 7.4227685928344727
    value: 6.9590597152709961
    value: 2.7081327438354492
    value: 3.0773305892944336
    value: 3.9870815277099609
    value: 2.0818126201629639
    value: 3.7327451705932617
    value: 0.525111973285675
    value: 0.20184960961341858
    value: 0.6251295804977417
    value: 1.22980535030365
    value: 2.7595179080963135
    value: -2.2009344100952148
    value: 0.63872003555297852
    value: 3.6590442657470703
    value: 2.8966288566589355
    value: 1.5799614191055298
    value: 8.2752857208251953
    value: 2.1280496120452881
    value: 2.4111166000366211
    value: -0.63606977462768555
    value: -3.2347993850708008
    value: 4.1374397277832031
    value: 2.5899045467376709
    value: 0.68589723110198975
    value: 1.4959858655929565
  }
}
layers {
  layer_name: "/backbone/stage2/stage2.0/activate/Relu_output_0"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 14.551506
    size: 1
    element_type: 1
    scale: 17.523960113525391
    zero_point: 4294967168
  }
  weights {
    min: -0.481280237
    max: 0.401244104
    size: 1
    element_type: 0
    scale: 265.95730590820312
    zero_point: 0
  }
  bias {
    min: -2.74892569
    max: 4.84956169
    size: 64
    element_type: 0
    scale: 26.394138336181641
    zero_point: 0
    value: 1.1934778690338135
    value: 1.742461085319519
    value: 1.143413782119751
    value: 0.94241201877593994
    value: 0.30648818612098694
    value: 1.0896315574645996
    value: 1.1705924272537231
    value: 0.54733717441558838
    value: 0.44617217779159546
    value: 2.2106227874755859
    value: 0.23050913214683533
    value: 0.27649322152137756
    value: -1.2750148773193359
    value: 1.6733882427215576
    value: 1.3235265016555786
    value: 0.0548667348921299
    value: 0.89994418621063232
    value: 0.86564290523529053
    value: 2.5520267486572266
    value: 2.0997200012207031
    value: 2.1963768005371094
    value: 1.4019041061401367
    value: -1.3356165885925293
    value: 0.37080839276313782
    value: 0.36261320114135742
    value: 0.661245584487915
    value: 1.4781386852264404
    value: 1.2167381048202515
    value: 2.1350440979003906
    value: -0.35864102840423584
    value: -0.17856158316135406
    value: 4.61444616317749
    value: 0.32931441068649292
    value: 0.56772923469543457
    value: 0.95707792043685913
    value: -1.9502129554748535
    value: 0.34019547700881958
    value: 1.9639708995819092
    value: 1.1352968215942383
    value: 1.9927974939346313
    value: 1.0692214965820312
    value: -0.3981252908706665
    value: 2.2418367862701416
    value: 0.68844300508499146
    value: 1.8042161464691162
    value: -0.74934995174407959
    value: 1.3790045976638794
    value: -1.4939442873001099
    value: 0.331429123878479
    value: 0.67829853296279907
    value: -0.03369971364736557
    value: 2.1653432846069336
    value: -2.7489256858825684
    value: 4.84956169128418
    value: 0.68871581554412842
    value: 0.28624498844146729
    value: 0.26067620515823364
    value: 1.0769960880279541
    value: 0.34112644195556641
    value: 0.66103309392929077
    value: 0.3086492121219635
    value: -0.071949824690818787
    value: -0.1783180832862854
    value: 1.5172989368438721
  }
}
layers {
  layer_name: "/backbone/stage2/stage2.1/short_conv/activate/Relu_output_0"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 13.5272007
    size: 1
    element_type: 0
    scale: 18.850906372070312
    zero_point: 0
  }
  weights {
    min: -1.74027121
    max: 1.38454735
    size: 1
    element_type: 0
    scale: 73.5517578125
    zero_point: 0
  }
  bias {
    min: -3.76234078
    max: 5.36403036
    size: 32
    element_type: 0
    scale: 23.862653732299805
    zero_point: 0
    value: 1.0977473258972168
    value: 1.6279871463775635
    value: -1.2339878082275391
    value: -2.9720678329467773
    value: 3.9338762760162354
    value: -2.2549574375152588
    value: 0.75797855854034424
    value: 0.73709499835968018
    value: 1.2608412504196167
    value: -2.1050164699554443
    value: 1.6445449590682983
    value: 0.7950325608253479
    value: 1.1154980659484863
    value: 3.6087934970855713
    value: -0.90458804368972778
    value: -0.66848975419998169
    value: -1.6174782514572144
    value: 1.0566338300704956
    value: 2.1252419948577881
    value: 1.500872015953064
    value: -1.3380124568939209
    value: -1.0338914394378662
    value: 5.3640303611755371
    value: 0.86086791753768921
    value: 0.44067239761352539
    value: 2.7944600582122803
    value: 0.43103921413421631
    value: 3.8737549781799316
    value: -3.762340784072876
    value: 0.22449570894241333
    value: -0.90547084808349609
    value: 0.3157937228679657
  }
}
layers {
  layer_name: "/backbone/stage2/stage2.1/main_conv/activate/Relu_output_0"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 7.06325102
    size: 1
    element_type: 0
    scale: 36.10235595703125
    zero_point: 0
  }
  weights {
    min: -0.562903285
    max: 0.506599545
    size: 1
    element_type: 0
    scale: 227.39253234863281
    zero_point: 0
  }
  bias {
    min: -0.880660713
    max: 3.14681149
    size: 32
    element_type: 0
    scale: 40.676094055175781
    zero_point: 0
    value: -0.18246270716190338
    value: 1.6906646490097046
    value: 2.5236732959747314
    value: 2.6145496368408203
    value: 1.0459393262863159
    value: 1.6515918970108032
    value: 1.248204231262207
    value: 2.075808048248291
    value: 1.6888651847839355
    value: 2.3470442295074463
    value: 0.058761145919561386
    value: 0.45325353741645813
    value: 0.29207506775856018
    value: 0.30017748475074768
    value: 2.1074426174163818
    value: -0.88066071271896362
    value: 2.3097896575927734
    value: 3.1468114852905273
    value: 2.6815335750579834
    value: 1.0945521593093872
    value: 1.4177753925323486
    value: 0.53440177440643311
    value: 1.8889398574829102
    value: 3.1069817543029785
    value: 0.90235978364944458
    value: 2.9126477241516113
    value: 0.648216187953949
    value: 1.919517993927002
    value: 0.90609955787658691
    value: 1.0099170207977295
    value: 1.090624213218689
    value: 0.66207975149154663
  }
}
layers {
  layer_name: "/backbone/stage2/stage2.1/blocks/blocks.0/conv1/activate/Relu_output_0"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 8.43630886
    size: 1
    element_type: 1
    scale: 30.226490020751953
    zero_point: 4294967168
  }
  weights {
    min: -1.19030404
    max: 2.07605648
    size: 1
    element_type: 0
    scale: 61.655353546142578
    zero_point: 0
  }
  bias {
    min: -6.90653419
    max: 4.3896513
    size: 32
    element_type: 0
    scale: 18.533174514770508
    zero_point: 0
    value: -1.9165058135986328
    value: -3.2124102115631104
    value: 0.98598599433898926
    value: 3.8311891555786133
    value: 0.47619020938873291
    value: 0.85022050142288208
    value: -0.622863233089447
    value: 0.98426282405853271
    value: 0.31840065121650696
    value: 0.77114737033843994
    value: 1.5141805410385132
    value: -1.716499924659729
    value: -1.5550181865692139
    value: -0.018333658576011658
    value: 0.6344306468963623
    value: 0.91341549158096313
    value: 1.2691432237625122
    value: -0.83239680528640747
    value: 0.49170145392417908
    value: -6.9065341949462891
    value: 0.79967236518859863
    value: 3.7510476112365723
    value: 1.284864068031311
    value: -5.3727970123291016
    value: -1.0101414918899536
    value: 0.8928182721138
    value: 1.2324668169021606
    value: 2.4807722568511963
    value: -2.8075382709503174
    value: 4.3896512985229492
    value: -4.1374759674072266
    value: 1.5931380987167358
  }
}
layers {
  layer_name: "/backbone/stage2/stage2.1/blocks/blocks.0/conv2/activate/Relu_output_0"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 6.81462145
    size: 1
    element_type: 0
    scale: 37.419540405273438
    zero_point: 0
  }
  weights {
    min: -0.613019168
    max: 0.388047278
    size: 1
    element_type: 0
    scale: 208.8026123046875
    zero_point: 0
  }
  bias {
    min: -2.27289796
    max: 1.59693527
    size: 32
    element_type: 0
    scale: 56.315769195556641
    zero_point: 0
    value: 0.36488574743270874
    value: 0.10284282267093658
    value: -0.384348064661026
    value: -0.7957419753074646
    value: 0.58407819271087646
    value: 0.54885536432266235
    value: 1.5574299097061157
    value: -0.21238422393798828
    value: 0.38503223657608032
    value: 1.0713973045349121
    value: 1.2661634683609009
    value: 0.76144075393676758
    value: -0.41776672005653381
    value: 0.4998982846736908
    value: -0.35373422503471375
    value: 0.70360124111175537
    value: 0.48117154836654663
    value: -0.5141107439994812
    value: 0.023159598931670189
    value: 0.6937258243560791
    value: 0.10672692954540253
    value: 1.0180181264877319
    value: 0.90325075387954712
    value: 1.5969352722167969
    value: 1.0336921215057373
    value: 0.0850749984383583
    value: 0.41677778959274292
    value: -0.0033474904485046864
    value: 1.0903427600860596
    value: -1.3648808002471924
    value: -2.2728979587554932
    value: 1.0153069496154785
  }
}
layers {
  layer_name: "/backbone/stage2/stage2.1/blocks/blocks.0/Add_output_0"
  layer_type: "TIDL_EltWiseLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 9.93297195
    size: 1
    element_type: 0
    scale: 18.051177978515625
    zero_point: 0
  }
}
layers {
  layer_name: "/backbone/stage2/stage2.1/blocks/blocks.1/conv1/activate/Relu_output_0"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 11.6524248
    size: 1
    element_type: 1
    scale: 21.883857727050781
    zero_point: 4294967168
  }
  weights {
    min: -0.859170794
    max: 1.26510823
    size: 1
    element_type: 0
    scale: 101.17711639404297
    zero_point: 0
  }
  bias {
    min: -5.73586893
    max: 8.67773914
    size: 32
    element_type: 0
    scale: 14.750386238098145
    zero_point: 0
    value: 0.35910680890083313
    value: 0.28564608097076416
    value: -0.31147921085357666
    value: 2.4205038547515869
    value: 3.23911714553833
    value: 0.79664516448974609
    value: 3.6552414894104004
    value: 3.302274227142334
    value: -2.1001553535461426
    value: -1.2152167558670044
    value: -5.73586893081665
    value: 8.677739143371582
    value: 0.073209315538406372
    value: 1.8964056968688965
    value: 2.1082429885864258
    value: 2.0005185604095459
    value: 0.68525958061218262
    value: -0.861665666103363
    value: 0.10007046908140182
    value: -0.23143851757049561
    value: 2.4210388660430908
    value: 0.2273232489824295
    value: 1.1878780126571655
    value: 2.2785847187042236
    value: 3.3865797519683838
    value: 1.5314825773239136
    value: 6.2618837356567383
    value: 4.60341215133667
    value: 0.57893925905227661
    value: 4.5267415046691895
    value: -0.072867602109909058
    value: 0.19886980950832367
  }
}
layers {
  layer_name: "/backbone/stage2/stage2.1/blocks/blocks.1/conv2/activate/Relu_output_0"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 10.2362423
    size: 1
    element_type: 0
    scale: 24.91148567199707
    zero_point: 0
  }
  weights {
    min: -0.529559672
    max: 0.649748206
    size: 1
    element_type: 0
    scale: 196.9993896484375
    zero_point: 0
  }
  bias {
    min: -1.36348474
    max: 2.19387412
    size: 32
    element_type: 0
    scale: 58.344276428222656
    zero_point: 0
    value: 1.7557668685913086
    value: -0.77044987678527832
    value: 0.22206023335456848
    value: -0.21998441219329834
    value: 1.568456768989563
    value: 1.1291940212249756
    value: 0.48397031426429749
    value: -0.25048708915710449
    value: 1.7691041231155396
    value: 0.76895588636398315
    value: 0.14247778058052063
    value: -0.18727847933769226
    value: -1.3634847402572632
    value: -0.88610708713531494
    value: -0.56995457410812378
    value: -0.099727503955364227
    value: -0.8305627703666687
    value: 0.04799463227391243
    value: 0.23307915031909943
    value: 1.2108612060546875
    value: 2.1938741207122803
    value: -0.049051336944103241
    value: 0.31811818480491638
    value: 1.8475507497787476
    value: 0.32207641005516052
    value: 0.38641190528869629
    value: 1.0916094779968262
    value: -0.4518929123878479
    value: 1.3656811714172363
    value: -1.1971909999847412
    value: -0.37719285488128662
    value: 0.58793008327484131
  }
}
layers {
  layer_name: "/backbone/stage2/stage2.1/blocks/blocks.1/Add_output_0"
  layer_type: "TIDL_EltWiseLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 13.4600573
    size: 1
    element_type: 0
    scale: 18.051177978515625
    zero_point: 0
  }
}
layers {
  layer_name: "/backbone/stage2/stage2.1/blocks/blocks.2/conv1/activate/Relu_output_0"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 9.01731396
    size: 1
    element_type: 1
    scale: 28.2789306640625
    zero_point: 4294967168
  }
  weights {
    min: -0.727622092
    max: 0.854564488
    size: 1
    element_type: 0
    scale: 149.78390502929688
    zero_point: 0
  }
  bias {
    min: -2.65115333
    max: 5.07801867
    size: 32
    element_type: 0
    scale: 25.206682205200195
    zero_point: 0
    value: -2.6511533260345459
    value: 2.428762674331665
    value: 0.89508229494094849
    value: -2.3203184604644775
    value: 2.2733793258666992
    value: 0.30762434005737305
    value: 5.0780186653137207
    value: 3.5200214385986328
    value: 0.47591909766197205
    value: 0.77465832233428955
    value: 1.7533670663833618
    value: 0.66245687007904053
    value: -0.051009226590394974
    value: 3.8470396995544434
    value: 2.6223149299621582
    value: 0.36129924654960632
    value: -0.8054690957069397
    value: 1.9820141792297363
    value: 2.899289608001709
    value: 1.5916165113449097
    value: 0.82171547412872314
    value: 1.5238224267959595
    value: 1.812152624130249
    value: 2.669952392578125
    value: 0.16837187111377716
    value: 1.1674929857254028
    value: 0.945634126663208
    value: 1.4681050777435303
    value: 2.1999654769897461
    value: 0.68604886531829834
    value: 0.021225558593869209
    value: 0.20275585353374481
  }
}
layers {
  layer_name: "/backbone/stage2/stage2.1/blocks/blocks.2/conv2/activate/Relu_output_0"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 13.4031353
    size: 1
    element_type: 0
    scale: 19.025400161743164
    zero_point: 0
  }
  weights {
    min: -0.811337292
    max: 0.719912052
    size: 1
    element_type: 0
    scale: 157.76422119140625
    zero_point: 0
  }
  bias {
    min: -1.29875219
    max: 3.46424508
    size: 32
    element_type: 0
    scale: 36.948886871337891
    zero_point: 0
    value: 3.0484049320220947
    value: -0.15885829925537109
    value: 1.5615813732147217
    value: 2.5167989730834961
    value: 1.0631042718887329
    value: 1.2489358186721802
    value: 0.16824522614479065
    value: 1.7284798622131348
    value: -1.2987521886825562
    value: 0.69099795818328857
    value: 0.626478374004364
    value: 3.464245080947876
    value: -0.18412762880325317
    value: 2.0350134372711182
    value: 1.101690411567688
    value: 1.0505002737045288
    value: 0.92242389917373657
    value: 1.2378915548324585
    value: 1.66384756565094
    value: 1.2433898448944092
    value: 0.38624772429466248
    value: 1.2329325675964355
    value: -0.15970101952552795
    value: 0.0056567909196019173
    value: 0.90548145771026611
    value: 0.58969402313232422
    value: 2.84118390083313
    value: 2.6581740379333496
    value: 0.35155463218688965
    value: -0.36955749988555908
    value: 0.17219109833240509
    value: 1.5578298568725586
  }
}
layers {
  layer_name: "/backbone/stage2/stage2.1/blocks/blocks.2/Add_output_0"
  layer_type: "TIDL_EltWiseLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 17.9101162
    size: 1
    element_type: 0
    scale: 9.0255889892578125
    zero_point: 0
  }
}
layers {
  layer_name: "/backbone/stage2/stage2.1/Concat_output_0"
  layer_type: "TIDL_ConcatLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 17.9101162
    size: 1
    element_type: 0
    scale: 9.0255889892578125
    zero_point: 0
  }
}
layers {
  layer_name: "/backbone/stage2/stage2.1/final_conv/activate/Relu_output_0"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 9.6439724
    size: 1
    element_type: 0
    scale: 26.441387176513672
    zero_point: 0
  }
  weights {
    min: -0.563219488
    max: 0.901977956
    size: 1
    element_type: 0
    scale: 141.91033935546875
    zero_point: 0
  }
  bias {
    min: -5.35722542
    max: 5.06832027
    size: 64
    element_type: 0
    scale: 23.892965316772461
    zero_point: 0
    value: -5.35722541809082
    value: 1.6404789686203003
    value: 0.5939820408821106
    value: -1.0708465576171875
    value: 1.3614256381988525
    value: 0.5814322829246521
    value: -0.17589184641838074
    value: -1.6760616302490234
    value: 1.2254863977432251
    value: 5.0683202743530273
    value: 1.69491446018219
    value: 1.0765162706375122
    value: 0.45915147662162781
    value: 2.0208272933959961
    value: -0.5168076753616333
    value: 0.81703376770019531
    value: 0.89941316843032837
    value: 0.9175339937210083
    value: -0.037624910473823547
    value: 1.561147928237915
    value: -2.3172121047973633
    value: -0.58971506357192993
    value: 0.12557558715343475
    value: 1.1611729860305786
    value: -2.779217004776001
    value: 1.3047630786895752
    value: 0.041932146996259689
    value: 0.30083298683166504
    value: -0.0475308820605278
    value: 0.096781924366950989
    value: 1.1496560573577881
    value: 0.19251036643981934
    value: 1.3662600517272949
    value: -0.78329771757125854
    value: 2.1938974857330322
    value: -2.0541205406188965
    value: -1.7152005434036255
    value: -0.491883784532547
    value: 0.85340464115142822
    value: 0.412714421749115
    value: -2.4737153053283691
    value: -0.8223610520362854
    value: 2.8004543781280518
    value: 0.56722360849380493
    value: -2.5350816249847412
    value: 0.9680970311164856
    value: 1.9036685228347778
    value: 1.5695626735687256
    value: -0.69408375024795532
    value: -0.39084812998771667
    value: -2.5653364658355713
    value: -0.921523928642273
    value: 1.8469436168670654
    value: -1.6562175750732422
    value: 1.0243930816650391
    value: 0.6783718466758728
    value: 3.2494540214538574
    value: 1.4236773252487183
    value: -0.52458161115646362
    value: 0.756356418132782
    value: 3.1588151454925537
    value: -0.10173705220222473
    value: 1.2063448429107666
    value: -1.5657743215560913
  }
}
layers {
  layer_name: "/backbone/stage3/stage3.0/activate/Relu_output_0"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 9.07356453
    size: 1
    element_type: 1
    scale: 28.103618621826172
    zero_point: 4294967168
  }
  weights {
    min: -0.594537795
    max: 0.57329464
    size: 1
    element_type: 0
    scale: 215.29328918457031
    zero_point: 0
  }
  bias {
    min: -2.67326069
    max: 3.24162912
    size: 128
    element_type: 0
    scale: 39.4863166809082
    zero_point: 0
    value: 1.330498218536377
    value: -0.33889251947402954
    value: -0.76386398077011108
    value: 1.7559207677841187
    value: 0.60335028171539307
    value: 0.37083950638771057
    value: 0.26907515525817871
    value: -2.6732606887817383
    value: -0.037289749830961227
    value: -1.7308382987976074
    value: 0.25545209646224976
    value: -0.43189904093742371
    value: 0.19169172644615173
    value: 2.8745307922363281
    value: 0.071583710610866547
    value: -1.2281455993652344
    value: -0.70907694101333618
    value: -0.3158404529094696
    value: 0.44747647643089294
    value: -0.21089041233062744
    value: -0.031453508883714676
    value: 1.2519872188568115
    value: 1.445756196975708
    value: -0.91430294513702393
    value: -0.38336437940597534
    value: 1.0663024187088013
    value: 0.58238095045089722
    value: -1.2316040992736816
    value: 0.71163231134414673
    value: 1.7536619901657104
    value: 0.86104768514633179
    value: -0.43475812673568726
    value: -0.29125583171844482
    value: -1.326255202293396
    value: -0.31614914536476135
    value: 0.76203036308288574
    value: 0.84768301248550415
    value: -1.8727759122848511
    value: 0.020335854962468147
    value: -0.36925607919692993
    value: -0.81181186437606812
    value: -0.72519582509994507
    value: 0.44302394986152649
    value: 1.2507551908493042
    value: 0.65134793519973755
    value: -0.51894384622573853
    value: -0.25944733619689941
    value: 0.67853665351867676
    value: -0.66018229722976685
    value: 1.4405591487884521
    value: 0.96385806798934937
    value: 0.58460861444473267
    value: -0.76205384731292725
    value: -1.0254156589508057
    value: -0.045910865068435669
    value: 0.46301934123039246
    value: 0.85342097282409668
    value: 3.2416291236877441
    value: -0.1512165367603302
    value: 0.36439472436904907
    value: 0.99100673198699951
    value: 0.11202779412269592
    value: 0.43039941787719727
    value: -0.30933251976966858
    value: 0.13864314556121826
    value: -0.53573781251907349
    value: -0.60221260786056519
    value: 0.82408523559570312
    value: -0.56809663772583008
    value: -1.2578628063201904
    value: 1.0494133234024048
    value: -0.52682185173034668
    value: -0.4953174889087677
    value: -2.0484800338745117
    value: -0.27502396702766418
    value: -0.290740430355072
    value: -0.840690016746521
    value: 0.093520946800708771
    value: -0.19133836030960083
    value: 1.1999439001083374
    value: -1.6202770471572876
    value: 0.18044205009937286
    value: 0.6165202260017395
    value: -0.43285807967185974
    value: -0.30148559808731079
    value: -0.2429969310760498
    value: 0.56848359107971191
    value: -0.54040837287902832
    value: 0.4053313136100769
    value: 0.10341093689203262
    value: -1.3639967441558838
    value: 1.6990522146224976
    value: -0.015496327541768551
    value: -0.6123930811882019
    value: 0.21052587032318115
    value: -0.33538258075714111
    value: -0.95649439096450806
    value: 0.74696147441864014
    value: 1.5904678106307983
    value: -0.662635862827301
    value: -0.54462099075317383
    value: 1.569988489151001
    value: 0.30476400256156921
    value: 0.86044168472290039
    value: 0.00052083167247474194
    value: 0.71314543485641479
    value: -0.861320436000824
    value: -1.162899374961853
    value: -1.8227564096450806
    value: 0.67874187231063843
    value: 1.5027308464050293
    value: 1.308998703956604
    value: 1.5347234010696411
    value: -0.70865076780319214
    value: -2.6648473739624023
    value: 0.08298967033624649
    value: -0.2154240757226944
    value: 1.6370183229446411
    value: 2.2076563835144043
    value: -0.52558481693267822
    value: 0.39769256114959717
    value: 0.29774782061576843
    value: 0.15568327903747559
    value: 1.2845717668533325
    value: -0.66364991664886475
    value: 1.2005152702331543
    value: -0.57389438152313232
    value: -0.1449323445558548
  }
}
layers {
  layer_name: "/backbone/stage3/stage3.1/short_conv/activate/Relu_output_0"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 10.7873678
    size: 1
    element_type: 0
    scale: 23.638759613037109
    zero_point: 0
  }
  weights {
    min: -1.28931248
    max: 1.38712811
    size: 1
    element_type: 0
    scale: 92.276985168457031
    zero_point: 0
  }
  bias {
    min: -3.29911733
    max: 4.0967083
    size: 64
    element_type: 0
    scale: 31.244596481323242
    zero_point: 0
    value: 0.6375727653503418
    value: -1.5154080390930176
    value: 0.777646005153656
    value: 1.9253185987472534
    value: -1.3093804121017456
    value: -0.46243894100189209
    value: 0.36532342433929443
    value: 0.3766404390335083
    value: 0.29790377616882324
    value: 1.98773992061615
    value: -1.1581289768218994
    value: 1.7812520265579224
    value: -0.68893802165985107
    value: -1.9334696531295776
    value: 3.7403218746185303
    value: -0.41751071810722351
    value: 2.5773370265960693
    value: 0.67162805795669556
    value: 0.566827654838562
    value: 0.53331440687179565
    value: -0.46232002973556519
    value: 1.1954054832458496
    value: 0.44998136162757874
    value: 0.66740846633911133
    value: 0.30267935991287231
    value: 0.030932225286960602
    value: -0.79210275411605835
    value: 1.4109237194061279
    value: 0.017476441338658333
    value: 1.2298170328140259
    value: 0.40065938234329224
    value: 0.45345541834831238
    value: 1.0968654155731201
    value: 0.9688647985458374
    value: -2.6568968296051025
    value: -2.0761849880218506
    value: 0.76889216899871826
    value: 0.53103542327880859
    value: -3.29911732673645
    value: -0.22247132658958435
    value: -2.3360695838928223
    value: 2.7548298835754395
    value: -1.9881836175918579
    value: 0.62356030941009521
    value: -0.42095547914505005
    value: 0.27209573984146118
    value: -1.3705757856369019
    value: -0.99722421169281006
    value: 0.558010995388031
    value: 0.91151398420333862
    value: 0.59289944171905518
    value: 0.04565732553601265
    value: 2.6376006603240967
    value: -1.3478239774703979
    value: -1.0947716236114502
    value: 1.102222204208374
    value: -1.1101462841033936
    value: -1.7159749269485474
    value: -1.0516376495361328
    value: -1.3094772100448608
    value: 1.5428484678268433
    value: -0.27039095759391785
    value: -0.91372144222259521
    value: 4.0967082977294922
  }
}
layers {
  layer_name: "/backbone/stage3/stage3.1/main_conv/activate/Relu_output_0"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 4.21767807
    size: 1
    element_type: 0
    scale: 60.459808349609375
    zero_point: 0
  }
  weights {
    min: -0.270812243
    max: 0.288999856
    size: 1
    element_type: 0
    scale: 442.90679931640625
    zero_point: 0
  }
  bias {
    min: -0.817085564
    max: 1.53181481
    size: 64
    element_type: 0
    scale: 83.5610122680664
    zero_point: 0
    value: 1.5318148136138916
    value: 0.30250898003578186
    value: 0.69022864103317261
    value: -0.21462081372737885
    value: 0.502811849117279
    value: 0.98196697235107422
    value: 0.1000886932015419
    value: -0.3349640965461731
    value: 0.18488988280296326
    value: 0.44712182879447937
    value: -0.81708556413650513
    value: 0.38083481788635254
    value: 0.090970478951931
    value: 0.19579136371612549
    value: 0.32475906610488892
    value: 0.091570585966110229
    value: -0.16293767094612122
    value: 0.95737212896347046
    value: -0.37134939432144165
    value: -0.37968957424163818
    value: -0.4733700156211853
    value: 1.1385877132415771
    value: 0.91816294193267822
    value: 1.1203700304031372
    value: 0.27650251984596252
    value: 0.42541256546974182
    value: 0.70654666423797607
    value: 0.70140349864959717
    value: 0.27657434344291687
    value: 0.36568376421928406
    value: -0.41255325078964233
    value: 0.129257470369339
    value: 0.16301165521144867
    value: 0.20823076367378235
    value: 0.52193403244018555
    value: 0.15055176615715027
    value: 1.0443068742752075
    value: 0.31520959734916687
    value: 0.97531276941299438
    value: -0.23260197043418884
    value: 0.37021762132644653
    value: 0.25650015473365784
    value: -0.58844536542892456
    value: 0.295915424823761
    value: 0.50928139686584473
    value: 0.45254164934158325
    value: -0.098478198051452637
    value: 0.17539709806442261
    value: 0.92096990346908569
    value: 0.993172287940979
    value: 0.22842186689376831
    value: 0.22920149564743042
    value: 0.067409992218017578
    value: 0.29458722472190857
    value: 0.77576649188995361
    value: 0.4477667510509491
    value: 0.44186282157897949
    value: 0.27852004766464233
    value: -0.20407992601394653
    value: 1.0000678300857544
    value: 0.97305119037628174
    value: -0.21502590179443359
    value: 0.51109397411346436
    value: 0.53314465284347534
  }
}
layers {
  layer_name: "/backbone/stage3/stage3.1/blocks/blocks.0/conv1/activate/Relu_output_0"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 8.17900658
    size: 1
    element_type: 1
    scale: 31.177379608154297
    zero_point: 4294967168
  }
  weights {
    min: -1.02807903
    max: 1.54940486
    size: 1
    element_type: 0
    scale: 82.61236572265625
    zero_point: 0
  }
  bias {
    min: -3.22612071
    max: 2.7751503
    size: 64
    element_type: 0
    scale: 39.6761360168457
    zero_point: 0
    value: -1.3338409662246704
    value: -0.58173328638076782
    value: 0.52370226383209229
    value: 2.2298545837402344
    value: 1.1470043659210205
    value: 0.26859146356582642
    value: -0.20717710256576538
    value: -1.3402966260910034
    value: 0.40095847845077515
    value: 2.7751502990722656
    value: 1.2869760990142822
    value: 0.19075693190097809
    value: 1.161543607711792
    value: 1.4654877185821533
    value: -1.7149853706359863
    value: -0.41017404198646545
    value: -3.2261207103729248
    value: -2.1602773666381836
    value: -0.8585248589515686
    value: -1.08182692527771
    value: 1.8048868179321289
    value: 2.2003653049468994
    value: -0.25766128301620483
    value: 0.5364338755607605
    value: 1.8025490045547485
    value: 1.1657085418701172
    value: 1.3894804716110229
    value: 2.0930659770965576
    value: -0.389941930770874
    value: -1.1536389589309692
    value: -2.2215564250946045
    value: 2.2924554347991943
    value: 2.1882009506225586
    value: 0.20577763020992279
    value: 1.6977659463882446
    value: -0.90080493688583374
    value: -1.0906187295913696
    value: -0.60304808616638184
    value: -0.88995683193206787
    value: -0.1594320684671402
    value: -0.60393106937408447
    value: -0.5674481987953186
    value: -0.82222360372543335
    value: -1.217699408531189
    value: -2.4556763172149658
    value: 0.65822118520736694
    value: 1.0158650875091553
    value: -0.57302397489547729
    value: -1.7311265468597412
    value: -1.568001389503479
    value: -0.85041922330856323
    value: -0.18059197068214417
    value: 0.59663236141204834
    value: 0.36809849739074707
    value: 0.1047624796628952
    value: -0.40588998794555664
    value: -0.38803130388259888
    value: -1.3131465911865234
    value: 0.76103377342224121
    value: -2.4083127975463867
    value: 0.80664277076721191
    value: -1.6085002422332764
    value: 2.3593647480010986
    value: -2.4124610424041748
  }
}
layers {
  layer_name: "/backbone/stage3/stage3.1/blocks/blocks.0/conv2/activate/Relu_output_0"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 5.88417578
    size: 1
    element_type: 0
    scale: 43.336570739746094
    zero_point: 0
  }
  weights {
    min: -0.311339587
    max: 0.339946032
    size: 1
    element_type: 0
    scale: 376.53036499023438
    zero_point: 0
  }
  bias {
    min: -1.35411215
    max: 1.66702271
    size: 64
    element_type: 0
    scale: 76.783599853515625
    zero_point: 0
    value: 1.667022705078125
    value: 0.14911799132823944
    value: 0.42924267053604126
    value: 0.283358097076416
    value: 0.46480706334114075
    value: -0.20211052894592285
    value: 0.056759007275104523
    value: 0.074756018817424774
    value: -0.47332900762557983
    value: 0.12106482684612274
    value: -1.1312499046325684
    value: -0.1879471093416214
    value: 0.39917853474617004
    value: 0.090888835489749908
    value: 0.1747211366891861
    value: -0.22176222503185272
    value: 0.53028357028961182
    value: -0.61401635408401489
    value: 0.17652556300163269
    value: -0.67220956087112427
    value: -0.14770941436290741
    value: 0.133064404129982
    value: 0.099483571946620941
    value: 0.19145703315734863
    value: 0.40581655502319336
    value: 0.13192197680473328
    value: -0.45476534962654114
    value: 0.23392720520496368
    value: -0.23162263631820679
    value: -0.206358402967453
    value: -0.57500886917114258
    value: 0.93063098192214966
    value: -0.073505975306034088
    value: 0.019400941208004951
    value: -0.445181667804718
    value: -0.61854183673858643
    value: 0.2001640647649765
    value: 0.18203455209732056
    value: -0.25838086009025574
    value: 0.58454817533493042
    value: -0.1562822163105011
    value: -0.18467530608177185
    value: -1.3541121482849121
    value: 0.076984919607639313
    value: 1.1895073652267456
    value: -0.023346591740846634
    value: 0.060232885181903839
    value: 0.52751600742340088
    value: -0.30969148874282837
    value: 0.033380459994077682
    value: -0.0061068818904459476
    value: -0.30390238761901855
    value: 0.7553284764289856
    value: 1.6219910383224487
    value: 0.069598682224750519
    value: -0.052889324724674225
    value: 0.37996172904968262
    value: 0.0700894445180893
    value: 0.15748251974582672
    value: -0.37361714243888855
    value: 0.24339316785335541
    value: -0.40528774261474609
    value: 0.31798672676086426
    value: -0.4318980872631073
  }
}
layers {
  layer_name: "/backbone/stage3/stage3.1/blocks/blocks.0/Add_output_0"
  layer_type: "TIDL_EltWiseLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 6.11335564
    size: 1
    element_type: 0
    scale: 21.668285369873047
    zero_point: 0
  }
}
layers {
  layer_name: "/backbone/stage3/stage3.1/blocks/blocks.1/conv1/activate/Relu_output_0"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 8.90775
    size: 1
    element_type: 1
    scale: 28.62675666809082
    zero_point: 4294967168
  }
  weights {
    min: -0.817524195
    max: 1.45834589
    size: 1
    element_type: 0
    scale: 87.770675659179688
    zero_point: 0
  }
  bias {
    min: -2.96600509
    max: 3.44904566
    size: 64
    element_type: 0
    scale: 37.111713409423828
    zero_point: 0
    value: -0.4619261622428894
    value: 1.8777263164520264
    value: -1.5787304639816284
    value: -1.5853664875030518
    value: 1.2176746129989624
    value: -1.3881156444549561
    value: -1.778773307800293
    value: 0.79394656419754028
    value: -1.1883782148361206
    value: -0.50094985961914062
    value: -1.5826127529144287
    value: 0.387833833694458
    value: 0.28217938542366028
    value: -1.3771405220031738
    value: 0.46536847949028015
    value: -0.014381040818989277
    value: -1.5432714223861694
    value: -0.56893426179885864
    value: 1.2042737007141113
    value: -1.5675039291381836
    value: -0.19490517675876617
    value: 0.32158589363098145
    value: 3.4490456581115723
    value: 0.88698452711105347
    value: 0.78383278846740723
    value: -1.1800323724746704
    value: -0.11499005556106567
    value: 1.2951787710189819
    value: 0.86037880182266235
    value: -0.307170569896698
    value: 0.54209685325622559
    value: 1.4946393966674805
    value: 0.22236445546150208
    value: -2.3711299896240234
    value: 1.1101284027099609
    value: 0.43351349234580994
    value: -2.7799735069274902
    value: 0.66538858413696289
    value: -0.8223954439163208
    value: -0.78621947765350342
    value: -2.9660050868988037
    value: -0.99499279260635376
    value: -0.353468656539917
    value: 0.043681029230356216
    value: 1.0254018306732178
    value: 0.8338431715965271
    value: 1.48043692111969
    value: 0.88896912336349487
    value: 0.22979635000228882
    value: 2.3076498508453369
    value: 1.1661299467086792
    value: 1.7139296531677246
    value: -0.66493433713912964
    value: -0.27218303084373474
    value: -2.6256201267242432
    value: -0.12515968084335327
    value: 0.41550284624099731
    value: 0.39652472734451294
    value: -1.538758397102356
    value: 1.5433422327041626
    value: 0.58203756809234619
    value: -0.1307547390460968
    value: 1.8217813968658447
    value: 0.90075069665908813
  }
}
layers {
  layer_name: "/backbone/stage3/stage3.1/blocks/blocks.1/conv2/activate/Relu_output_0"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 9.00436401
    size: 1
    element_type: 0
    scale: 28.319601058959961
    zero_point: 0
  }
  weights {
    min: -0.467082292
    max: 0.47803238
    size: 1
    element_type: 0
    scale: 267.7642822265625
    zero_point: 0
  }
  bias {
    min: -1.29553807
    max: 2.2089951
    size: 64
    element_type: 0
    scale: 57.944900512695312
    zero_point: 0
    value: 0.73107677698135376
    value: -0.047520991414785385
    value: 0.21977458894252777
    value: 0.50664663314819336
    value: -0.19326430559158325
    value: 0.400204062461853
    value: 0.49125394225120544
    value: -0.45375069975852966
    value: -1.295538067817688
    value: -0.0091486796736717224
    value: 0.49670973420143127
    value: 0.7909507155418396
    value: -0.22469142079353333
    value: 0.17090438306331635
    value: 0.12753510475158691
    value: 0.32885873317718506
    value: 0.21883776783943176
    value: -0.013519815169274807
    value: 0.46305376291275024
    value: 0.65682768821716309
    value: 0.85822230577468872
    value: 0.52613770961761475
    value: 1.2116318941116333
    value: 0.72681349515914917
    value: 0.027955012395977974
    value: 0.21614013612270355
    value: 0.43520605564117432
    value: -0.095071405172348022
    value: 0.53946733474731445
    value: 0.2626514732837677
    value: -1.0522212982177734
    value: 0.41024920344352722
    value: 0.35468703508377075
    value: 0.87933486700057983
    value: 0.31285309791564941
    value: 0.13377159833908081
    value: -0.021001119166612625
    value: 0.34965330362319946
    value: 0.17936407029628754
    value: 0.1814156174659729
    value: 0.83407312631607056
    value: 0.3884090781211853
    value: 0.049982067197561264
    value: 0.18162745237350464
    value: 0.081397965550422668
    value: 1.3318800926208496
    value: 1.1253787279129028
    value: 0.29759976267814636
    value: 0.24729016423225403
    value: -0.30305585265159607
    value: 0.64137941598892212
    value: 0.29740571975708008
    value: 0.42331206798553467
    value: 2.2089951038360596
    value: 0.49267145991325378
    value: 1.3838480710983276
    value: 0.095727965235710144
    value: 1.1264464855194092
    value: 0.1414584219455719
    value: 0.77431505918502808
    value: 0.10198400169610977
    value: 0.14849542081356049
    value: 0.049245182424783707
    value: -0.028624298050999641
  }
}
layers {
  layer_name: "/backbone/stage3/stage3.1/blocks/blocks.1/Add_output_0"
  layer_type: "TIDL_EltWiseLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 10.7715721
    size: 1
    element_type: 0
    scale: 21.668285369873047
    zero_point: 0
  }
}
layers {
  layer_name: "/backbone/stage3/stage3.1/blocks/blocks.2/conv1/activate/Relu_output_0"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 1
  outputs {
    min: 0
    max: 9.05230427
    size: 1
    element_type: 1
    scale: 28.169622421264648
    zero_point: 4294967168
  }
  weights {
    min: -0.706343174
    max: 0.69033736
    size: 1
    element_type: 0
    scale: 181.21502685546875
    zero_point: 0
  }
  bias {
    min: -4.37992525
    max: 2.31069279
    size: 64
    element_type: 0
    scale: 29.2242431640625
    zero_point: 0
    value: 1.7678743600845337
    value: -0.1241900622844696
    value: -0.70205062627792358
    value: 1.1912786960601807
    value: 0.52318590879440308
    value: 1.9396775960922241
    value: 1.0929793119430542
    value: -0.47109302878379822
    value: 0.10890771448612213
    value: 1.1315290927886963
    value: 1.2282638549804688
    value: -0.021528329700231552
    value: -1.0364015102386475
    value: 1.9001296758651733
    value: -4.37992525100708
    value: -0.3234734833240509
    value: 1.5882965326309204
    value: -0.1701495349407196
    value: 0.59428083896636963
    value: 0.6980663537979126
    value: -0.10174417495727539
    value: 0.14719937741756439
    value: 0.72402876615524292
    value: 2.202467679977417
    value: 0.6258808970451355
    value: 0.78662770986557007
    value: 1.2908895015716553
    value: 0.64175713062286377
    value: 0.96979904174804688
    value: -0.029037304222583771
